:PROPERTIES:
:ID:       2b5f2b28-4a45-42e4-b009-9ca295f726c4
:END:
#+title: Rust basics
#+filetags: :project:

*** mutable reference to immutable variable
#+begin_src rust :exports both
fn main() {
    let x = 5;
    let y = &mut x;
    ,*y = 8;
}
#+end_src

#+RESULTS:
: error[E0596]: cannot borrow `x` as mutable, as it is not declared as mutable

*** immutable reference to mutable variable
#+begin_src rust :exports both
fn main() {
    let mut x = 5;
    let y = &x;
    *y = 8;
}
#+end_src

#+RESULTS:
: error[E0594]: cannot assign to `*y`, which is behind a `&` reference
: |     let y = &x;
: |             -- help: consider changing this to be a mutable reference: `&mut x`
: |     *y = 8;
: |     ^^^^^^ `y` is a `&` reference, so the data it refers to cannot be written

**** another example
#+begin_src rust :exports both
fn main() {
    let mut x = Box::new(42);
                            //     first iteration       | second iteration      | ...
    let mut z = &x;         // 1   lifetime 'a - created
    for i in 0..3 {
        println!("{}", z);  // 2   lifetime 'a - checked,  lifetime 'b - checked
        x = Box::new(i);    // 3   lifetime 'a - deleted,  lifetime 'b - deleted
        z = &x;             // 4   lifetime 'b - created,  lifetime 'c - created
    }
    println!("{}", z);
}
#+end_src

#+RESULTS:
: 42
: 0
: 1
: 2
*** generic lifetimes
#+begin_src rust
struct StrSplit<'s, 'p> {
  delimiter: &'p str,
  document: &'s str,
}

impl<'s, 'p> Iterator for StrSplit<'s, 'p> {
  type Item = &'s str;
  fn next(&mut self) -> Option<Self::Item> {
    self.document.split(self.delimiter).next()
}}

fn main() {
    let mut a = "ast,ars";
    let d = ",";
    let mut x = StrSplit{delimiter: &d, document:&a};
    a = "ff,ff";
    for i in x.next() {println!("{}", i);}
    println!("{}", a);
}
#+end_src

#+RESULTS:
: ast
: ff,ff
